<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/e666629c-e231-4e01-acd6-181420130ccd/terraform-bin -chdir=terraform show -no-color /tmp/plan.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ecs.aws_appautoscaling_policy.cpu_scaling will be created
  + resource "aws_appautoscaling_policy" "cpu_scaling" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "walletconnect-staging-history-application-scaling-policy-cpu"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/walletconnect-staging-history/walletconnect-staging-history-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 180
          + scale_out_cooldown = 90
          + target_value       = 30

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.ecs.aws_appautoscaling_policy.memory_scaling will be created
  + resource "aws_appautoscaling_policy" "memory_scaling" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "walletconnect-staging-history-application-scaling-policy-memory"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/walletconnect-staging-history/walletconnect-staging-history-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 180
          + scale_out_cooldown = 90
          + target_value       = 30

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.ecs.aws_appautoscaling_target.ecs_target will be created
  + resource "aws_appautoscaling_target" "ecs_target" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 3
      + min_capacity       = 1
      + resource_id        = "service/walletconnect-staging-history/walletconnect-staging-history-service"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = {
          + "Application" = "history"
          + "Environment" = "eu-central-1"
          + "Name"        = "walletconnect-eu-central-1-staging-history"
          + "Namespace"   = "walletconnect"
          + "Stage"       = "staging"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.ecs.aws_appautoscaling_policy.cpu_scaling will be created%0A  + resource "aws_appautoscaling_policy" "cpu_scaling" {%0A      + alarm_arns         = (known after apply)%0A      + arn                = (known after apply)%0A      + id                 = (known after apply)%0A      + name               = "walletconnect-staging-history-application-scaling-policy-cpu"%0A      + policy_type        = "TargetTrackingScaling"%0A      + resource_id        = "service/walletconnect-staging-history/walletconnect-staging-history-service"%0A      + scalable_dimension = "ecs:service:DesiredCount"%0A      + service_namespace  = "ecs"%0A%0A      + target_tracking_scaling_policy_configuration {%0A          + disable_scale_in   = false%0A          + scale_in_cooldown  = 180%0A          + scale_out_cooldown = 90%0A          + target_value       = 30%0A%0A          + predefined_metric_specification {%0A              + predefined_metric_type = "ECSServiceAverageCPUUtilization"%0A            }%0A        }%0A    }%0A%0A  # module.ecs.aws_appautoscaling_policy.memory_scaling will be created%0A  + resource "aws_appautoscaling_policy" "memory_scaling" {%0A      + alarm_arns         = (known after apply)%0A      + arn                = (known after apply)%0A      + id                 = (known after apply)%0A      + name               = "walletconnect-staging-history-application-scaling-policy-memory"%0A      + policy_type        = "TargetTrackingScaling"%0A      + resource_id        = "service/walletconnect-staging-history/walletconnect-staging-history-service"%0A      + scalable_dimension = "ecs:service:DesiredCount"%0A      + service_namespace  = "ecs"%0A%0A      + target_tracking_scaling_policy_configuration {%0A          + disable_scale_in   = false%0A          + scale_in_cooldown  = 180%0A          + scale_out_cooldown = 90%0A          + target_value       = 30%0A%0A          + predefined_metric_specification {%0A              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"%0A            }%0A        }%0A    }%0A%0A  # module.ecs.aws_appautoscaling_target.ecs_target will be created%0A  + resource "aws_appautoscaling_target" "ecs_target" {%0A      + arn                = (known after apply)%0A      + id                 = (known after apply)%0A      + max_capacity       = 3%0A      + min_capacity       = 1%0A      + resource_id        = "service/walletconnect-staging-history/walletconnect-staging-history-service"%0A      + role_arn           = (known after apply)%0A      + scalable_dimension = "ecs:service:DesiredCount"%0A      + service_namespace  = "ecs"%0A      + tags_all           = {%0A          + "Application" = "history"%0A          + "Environment" = "eu-central-1"%0A          + "Name"        = "walletconnect-eu-central-1-staging-history"%0A          + "Namespace"   = "walletconnect"%0A          + "Stage"       = "staging"%0A        }%0A    }%0A%0APlan: 3 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Action: `pull_request`*